{"front-page":"index.html","about-page":"about.html","theme-list":["programming","economics","lisp","basic-science","artificial-intelligence","india","iitb","life"],"theme-link-id-list-map":{"economics":[30,2,1],"india":[21,4,3],"programming":[32,31,22,7,5],"lisp":[9,8],"basic-science":[14,13,12,11,10],"life":[38,37,36,35,34,33,23,20,19,18,17,16,15],"iitb":[29,28,27,26,25,24]},"num-links":37,"about":"<p>There is a lot of content on the internet; however, human life is short. Just 80 years. With one-third of our life lost in sleep, that leaves us with about 54 years. Subtract another 12 for our kids. 42. (The answer to everything? :P)<\/p><p>People spend as much as <a href=\"https:\/\/www.broadbandsearch.net\/blog\/average-daily-time-on-social-media\">2 hours<\/a> each day on social media - about 60000 hours in our lifetime!<\/p><p>We won&#039;t go into the <a href=\"https:\/\/www.businessinsider.in\/strategy\/new-study-destroys-malcolm-gladwells-famous-10000-hour-rule\/articleshow\/37721084.cms\">10000 hour-rule<\/a>, but would point out that time is precious, and putting in time in the things that matter most to you makes a difference.<\/p><p>In our quest, we propose that there are only a few limited things on the internet that make a difference to the way you live your life, to the way you approach things. Some of these things have an economic benefit, while some social.<\/p><p>Newbies in various fields can be lost while looking for help. However, if they know a few core things, may be, they won&#039;t be lost, and would then look into the right places, perhaps, after doing some homework.<\/p><p>It is with this vision this website is in existence - to create a repository of &quot;must-know&quot; knowledge of the world. This excludes things that continually renew themselves. A very broad example would be News - not everyone needs to know what happened when of all times. There are much better sites - news sites, Reddit, Quora and much other platforms - much better than us. What would be of relevance for us, instead, would be the places to discuss news itself. And so, the links to these websites, the links to the specific Spaces, Subreddits and Forums where people discuss the news, where you should go if you want to understand or formulate viewpoints of any current happenings.<\/p><p>Things of relavance, then, include the &quot;essences&quot; of various things: people, sciences, mathematics, laws and ethics, money and economics, career advice. You choose the more narrower topics like your country or occupation or the places relevant to you.<\/p><p>Our aim is to not have a hundred opinions stating the same things again and again. Our aim is to avoid repetivity that plagues most sites - you&#039;d know it if you have been on the internet for more than a while.<\/p><p>Thank you for visiting us! You can drop us a feedback at <a href=\"https:\/\/docs.google.com\/forms\/d\/e\/1FAIpQLScP88qGXeg1X0GSYLYjMbvqex8FpWvQ4twZLKnEFbDYWUG8wg\/viewform?usp=sf_link\" target=\"_blank\">this place<\/a>.<\/p><br \/><br \/>"}